pallet.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Reference</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet is a node provisioning, configuration and administration tool."/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="doc.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Pallet Reference</h1>


<p>
Pallet is a node provisioning, configuration and administration tool.  It is
written in <a href="http://clojure.org">Clojure</a>, and runs on the JVM.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 First Steps </a>
<ul>
<li><a href="#sec-1_1">1.1 Overview </a></li>
<li><a href="#sec-1_2">1.2 Install </a>
<ul>
<li><a href="#sec-1_2_1">1.2.1 Source </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Talking to the cloud </a>
<ul>
<li><a href="#sec-2_1">2.1 Cloud Provider Names </a></li>
<li><a href="#sec-2_2">2.2 Explicit credentials </a></li>
<li><a href="#sec-2_3">2.3 Credentials in settings.xml </a></li>
</ul>
</li>
<li><a href="#sec-3">3 Talking to nodes </a>
<ul>
<li><a href="#sec-3_1">3.1 The <code>admin</code> User </a></li>
<li><a href="#sec-3_2">3.2 Other SSH Key Strategies </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Node Types </a>
<ul>
<li><a href="#sec-4_1">4.1 Tags </a></li>
<li><a href="#sec-4_2">4.2 Image Templates </a></li>
</ul>
</li>
<li><a href="#sec-5">5 Phases </a>
<ul>
<li><a href="#sec-5_1">5.1 :bootstrap </a></li>
<li><a href="#sec-5_2">5.2 :configure </a></li>
</ul>
</li>
<li><a href="#sec-6">6 Operations </a>
<ul>
<li><a href="#sec-6_1">6.1 Converge </a></li>
<li><a href="#sec-6_2">6.2 Lift </a></li>
</ul>
</li>
<li><a href="#sec-7">7 Crates </a>
<ul>
<li><a href="#sec-7_1">7.1 Composing existing crates </a></li>
<li><a href="#sec-7_2">7.2 Creating resources </a></li>
<li><a href="#sec-7_3">7.3 Aggregate resource </a></li>
<li><a href="#sec-7_4">7.4 Local resources </a></li>
<li><a href="#sec-7_5">7.5 Parameters </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> First Steps </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1_1" class="outline-3">
<h3 id="sec-1_1"><span class="section-number-3">1.1</span> Overview </h3>
<div class="outline-text-3" id="text-1_1">


<p>
The simplest way to start pallet (but definitely not the nicest) is with a git
checkout of the source and maven (see below).
</p>



<div class="org-src-container"><label class="org-src-name">def-service()</label><pre class="src src-clojure">
(<span style="color: #0000ff;">require</span> 'pallet.maven)
(<span style="color: #0000ff;">require</span> 'org.jclouds.compute)
(<span style="color: #4682b4;">def</span> <span style="color: #0000ff;">service</span>
     (<span style="color: #0000ff;">apply</span> org.jclouds.compute/compute-service
      (<span style="color: #0000ff;">concat</span> (pallet.maven/credentials) [<span style="color: #0000ff;">:log4j</span> <span style="color: #0000ff;">:enterprise</span> <span style="color: #0000ff;">:ssh</span>])))
</pre></div>





</div>

</div>

<div id="outline-container-1_2" class="outline-3">
<h3 id="sec-1_2"><span class="section-number-3">1.2</span> Install </h3>
<div class="outline-text-3" id="text-1_2">


<p>
Pallet can be used in projects as a jar file.  It is available at <a href="http://clojars.org/pallet">Clojars</a>, and
can be used with maven, leiningen or any maven repository aware tool.
</p>



<pre class="src src-clojure">(<span style="color: #4682b4;">def</span> <span style="color: #0000ff;">service</span>
     (<span style="color: #0000ff;">apply</span> org.jclouds.compute/compute-service
      (<span style="color: #0000ff;">concat</span> (pallet.maven/credentials) [<span style="color: #0000ff;">:log4j</span> <span style="color: #0000ff;">:enterprise</span> <span style="color: #0000ff;">:ssh</span>])))
</pre>






</div>

<div id="outline-container-1_2_1" class="outline-4">
<h4 id="sec-1_2_1"><span class="section-number-4">1.2.1</span> Source </h4>
<div class="outline-text-4" id="text-1_2_1">

<p>Pallet is available on <a href="http://github.com/hugoduncan/pallet">github</a>. Pallet requires <a href="http://clojure.org/">Clojure 1.2</a>, and uses <a href="http://github.com/jclouds/jclouds">JClouds</a>.
</p>



<pre class="src src-sh">git clone git://github.com/hugoduncan/pallet.git
</pre>



<p>
You can start a REPL using maven.  At this time lein can not be used to start a
REPL.
</p>



<pre class="src src-sh">mvn clojure:repl
</pre>



<p>
Using lein or maven you can also start a swank session, and connect to it with
Emacs, etc.
</p>



<pre class="src src-sh">mvn clojure:swank -Dmaven.test.skip=true
</pre>




<pre class="src src-sh">lein swank
</pre>







</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Talking to the cloud </h2>
<div class="outline-text-2" id="text-2">


<p>
Pallet uses <a href="http://jclouds.org">jclouds</a> to create, start and stop nodes.  In order to use the cloud,
you will need to specify your cloud credentials.  Each cloud has a slightly
different terminology for the username/key and password/secret.
</p>

</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Cloud Provider Names </h3>
<div class="outline-text-3" id="text-2_1">


<p>
In order to sign in to your cloud API, you will need to tell pallet the name of
your cloud.  The names pallet recognises can be displayed with the following:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.compute)
(pallet.compute/supported-clouds)
</pre>



</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Explicit credentials </h3>
<div class="outline-text-3" id="text-2_2">


<p>
You can log in to the cloud explicitly
</p>



<div class="org-src-container"><label class="org-src-name">explicit-credentials()</label><pre class="src src-clojure">
(<span style="color: #0000ff;">require</span> 'org.jclouds.compute)
(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">service</span> []
  (org.jclouds.compute/compute-service
   <span style="color: #f4a460;">"provider"</span> <span style="color: #f4a460;">"username"</span> <span style="color: #f4a460;">"password"</span> <span style="color: #0000ff;">:log4j</span> <span style="color: #0000ff;">:enterprise</span> <span style="color: #0000ff;">:ssh</span>))
</pre></div>



</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Credentials in settings.xml </h3>
<div class="outline-text-3" id="text-2_3">


<p>
Settings.xml is a maven file, often used to hold user specific configuration for
maven.  You can add your cloud provider information to this file, which is
normally located at <a href="/Users/duncan/.m2/settings.xml">~/.m2/settings.xml</a>.
</p>



<pre class="src src-nxml"><span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">settings</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">profiles</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">profile</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>terremark<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">id</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">activation</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">activeByDefault</span><span style="color: #00cd00;">&gt;</span>true<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">activeByDefault</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">activation</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">properties</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">pallet.service</span><span style="color: #00cd00;">&gt;</span>Your Cloud serivce name<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">pallet.service</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">pallet.user</span><span style="color: #00cd00;">&gt;</span>Your Cloud API username or key<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">pallet.user</span><span style="color: #00cd00;">&gt;</span>
        <span style="color: #00cd00;">&lt;</span><span style="color: #5f9ea0;">pallet.key</span><span style="color: #00cd00;">&gt;</span>Your Cloud API secret or password<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">pallet.key</span><span style="color: #00cd00;">&gt;</span>
      <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">properties</span><span style="color: #00cd00;">&gt;</span>
    <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">profile</span><span style="color: #00cd00;">&gt;</span>
  <span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">profiles</span><span style="color: #00cd00;">&gt;</span>
<span style="color: #00cd00;">&lt;</span><span style="color: #00cd00;">/</span><span style="color: #5f9ea0;">settings</span><span style="color: #00cd00;">&gt;</span>
</pre>



<p>
You can then use this information with pallet:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.maven)
(<span style="color: #4682b4;">def</span> <span style="color: #0000ff;">service</span>
     (<span style="color: #0000ff;">apply</span> org.jclouds.compute/compute-service
            (<span style="color: #0000ff;">concat</span> (pallet.maven/credentials) [<span style="color: #0000ff;">:log4j</span> <span style="color: #0000ff;">:enterprise</span> <span style="color: #0000ff;">:ssh</span>])))
</pre>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Talking to nodes </h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> The <code>admin</code> User </h3>
<div class="outline-text-3" id="text-3_1">


<p>
To SSH to a node, pallet requires a username and an SSH key.  These are read
from <code>pallet.utils/*admin-user*</code>, which defaults to your username, and <code>id_rsa</code>
identity.  You can rebind this using <code>pallet.core/with-admin-user</code>.
</p>
</div>

</div>

<div id="outline-container-3_2" class="outline-3">
<h3 id="sec-3_2"><span class="section-number-3">3.2</span> Other SSH Key Strategies </h3>
<div class="outline-text-3" id="text-3_2">

<p>While convenient, having all your nodes authorise the same SSH key is not the
best security practice.  Pallet allows you to install a middleware to provide an
identity using you own strategy, <code>pallet.core/with-node-execution-wrapper</code>. A
per node identity could be implemented using something like this:
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(<span style="color: #0000ff;">require</span> 'pallet.execute)
(<span style="color: #0000ff;">require</span> 'clj-ssh.ssh)

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">lookup-identity</span> [request]
  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">Implement this to
</span>  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">return [private-key public-key passphrase]
</span>  )

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">node-based-identity</span>
 [handler]
 (<span style="color: #0000ff;">fn</span> [request]
  (<span style="color: #4682b4;">binding</span> [pallet.execute/default-agent-atom (<span style="color: #0000ff;">atom</span> nil)]
    (<span style="color: #0000ff;">apply</span> clj-ssh.ssh/add-identity
     (pallet.execute/default-agent)
     (lookup-identity))
    (handler request))))

(pallet.core/with-node-execution-wrapper node-based-identity
  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">perform some configuration actions
</span>  <span style="color: #8b0000;">;; </span><span style="color: #cd5c5c;">(lift ....)
</span>  )
</pre>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><a name="node-types" id="node-types"></a><span class="section-number-2">4</span> Node Types </h2>
<div class="outline-text-2" id="text-4">


<p>
In pallet, node types are defined with <code>defnode</code>.  The minimum requirement is
for a tag and an empty image template specification.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag [])
</pre>



<p>
An empty template specification implies a default image will be used for the
nodes, usually the latest Ubuntu version, or CentOS if no Ubuntu images are
available.
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Tags </h3>
<div class="outline-text-3" id="text-4_1">


<p>
In pallet, tags are used to identify identically configured machines.  The
<code>converge</code> command can be used to control the number of machines running with
each tag, allowing simple cluster management. Tag names may not contain hyphens.
</p>
<p>
Tags are used to select the nodes targeted by a <code>converge</code> or <code>lift</code> operation.
</p>
</div>

</div>

<div id="outline-container-4_2" class="outline-3">
<h3 id="sec-4_2"><span class="section-number-3">4.2</span> Image Templates </h3>
<div class="outline-text-3" id="text-4_2">


<p>
The image used for a node can be specified by using JCloud's template
mechanism.  The image template in <code>defnode</code> is exactly as for jclouds clojure API.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag [<span style="color: #0000ff;">:centos</span> <span style="color: #0000ff;">:min-ram</span> 512 <span style="color: #0000ff;">:min-cores</span> 4])
</pre>



</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Phases </h2>
<div class="outline-text-2" id="text-5">


<p>
A phase specifies a sequence of crates to be executed.  A phase can be defined
as part of a <a href="#sec-4">node type</a>, or inline in a <code>configure</code> or <code>lift</code> invocation, using
the <code>phase</code> macro.
</p>

</div>

<div id="outline-container-5_1" class="outline-3">
<h3 id="sec-5_1"><span class="section-number-3">5.1</span> :bootstrap </h3>
<div class="outline-text-3" id="text-5_1">


<p>
The <code>:bootstrap</code> phase is applied whenever pallet starts a new node.
</p>
</div>

</div>

<div id="outline-container-5_2" class="outline-3">
<h3 id="sec-5_2"><span class="section-number-3">5.2</span> :configure </h3>
<div class="outline-text-3" id="text-5_2">


<p>
The <code>:configue</code> phase is applied by default by both the <code>converge</code> and the
<code>lift</code> commands.
</p>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Operations </h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6_1" class="outline-3">
<h3 id="sec-6_1"><span class="section-number-3">6.1</span> Converge </h3>
<div class="outline-text-3" id="text-6_1">


<p>
The <code>converge</code> function can be used to adjust node counts and to apply phases.
The <code>:bootstrap</code> phase is the first phase applied to any new node that is
started, and <code>:configure</code> is always applied.  Additional phases may also be
specified. If the <code>:configure</code> phase is not explicitly passed, then it will
always be applied as the first phase (or second, after <code>:bootstrap</code> on new
nodes).
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(pallet.core/defnode mytag [])

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">scale-cluster</span> [n]
  (pallet.core/converge {mytag n}))
</pre>



<p>
<code>converge</code> also accepts a prefix, which is applied to the tags in the call.
This can be used to build job specific clusters.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.core)
(<span style="color: #0000ff;">require</span> 'pallet.resource)
(<span style="color: #0000ff;">require</span> 'pallet.crate.automated-admin-user)

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">my-bootstrap</span>
  [request]
  (pallet.crate.automated-admin-user/automated-admin-user <span style="color: #f4a460;">"user"</span>))

(pallet.core/defnode lb []
  <span style="color: #0000ff;">:bootstrap</span> (pallet.resource/phase my-bootstrap))
(pallet.core/defnode webapp []
  <span style="color: #0000ff;">:bootstrap</span> (pallet.resource/phase my-bootstrap))
(pallet.core/defnode db []
  <span style="color: #0000ff;">:bootstrap</span> (pallet.resource/phase my-bootstrap))

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">scale-cluster</span> [prefix n]
  (pallet.core/converge prefix {lb 1 webapp n db (<span style="color: #0000ff;">inc</span> (<span style="color: #0000ff;">/</span> n 2))}))
</pre>



</div>

</div>

<div id="outline-container-6_2" class="outline-3">
<h3 id="sec-6_2"><span class="section-number-3">6.2</span> Lift </h3>
<div class="outline-text-3" id="text-6_2">


<p>
The <code>lift</code> function is used to apply phases. The :configure phase is run by
default only if no phases are explicitly specified.
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Crates </h2>
<div class="outline-text-2" id="text-7">

<p>Crates are functions that encapsulate some unit of configuration or
administration.  A crate must have a first <code>request</code> argument, and must
return an request map. The request can be threaded using clojure's <code>-&gt;</code>
macro. Crates can take other arguments as required.
</p>

</div>

<div id="outline-container-7_1" class="outline-3">
<h3 id="sec-7_1"><span class="section-number-3">7.1</span> Composing existing crates </h3>
<div class="outline-text-3" id="text-7_1">

<p>The simplest way of creating a crate is to compose it from existing crates.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.resource.package)
(<span style="color: #0000ff;">require</span> 'pallet.crate.git)
(<span style="color: #0000ff;">require</span> 'pallet.crate.tomcat)

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">my-simple-config</span>
  [request]
  (<span style="color: #4682b4;">-&gt;</span> request
    (pallet.resource.package/package <span style="color: #f4a460;">"maven2"</span>)
    (pallet.crate.git/git)
    (pallet.crate.tomcat/tomcat)))
</pre>



</div>

</div>

<div id="outline-container-7_2" class="outline-3">
<h3 id="sec-7_2"><span class="section-number-3">7.2</span> Creating resources </h3>
<div class="outline-text-3" id="text-7_2">

<p><code>defresource</code> can be used to define crates that generate custom script..
</p>
</div>

</div>

<div id="outline-container-7_3" class="outline-3">
<h3 id="sec-7_3"><span class="section-number-3">7.3</span> Aggregate resource </h3>
<div class="outline-text-3" id="text-7_3">


<p>
<code>defaggregate</code> can be used to define crates that collect parameters over
multiple invocations and emit a resource based on the aggregated parameters.
This is used in the sudoers crate, for example, to emit /etc/sudoers.
</p>
</div>

</div>

<div id="outline-container-7_4" class="outline-3">
<h3 id="sec-7_4"><span class="section-number-3">7.4</span> Local resources </h3>
<div class="outline-text-3" id="text-7_4">

<p><code>deflocal</code> defines a crate that will be run on the local machine.
</p>
</div>

</div>

<div id="outline-container-7_5" class="outline-3">
<h3 id="sec-7_5"><span class="section-number-3">7.5</span> Parameters </h3>
<div class="outline-text-3" id="text-7_5">

<p>The request map contains a :parameters key, which is used by crates to communicate
configuration to each other.
</p>

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 24</p>
</div>
</div>
</body>
</html>
